In [20]:
# Creating a database using sqlite

#Example 1

import sqlite3 as sql
# Connect to a database (or create it if it doesn't exist)
connection = sql.connect('bda74.db')
# Create a cursor object using the connection. A cursor is a control structure that enables traversal over the records in a database.
cursor = connection.cursor()

In [21]:
# Creating an sql table in python

cursor.execute('''
CREATE TABLE people2(
 id INTEGER PRIMARY KEY,
 name TEXT NOT NULL,
 age INTEGER,
 city TEXT
);
''')
# Commit the changes and close the connection
connection.commit()

In [23]:
# Inserting Data using INSERT statement
## INSERT INTO people2 (name, age, city) VALUES ('Alice', 30, 'New York');
### INSERT INTO people2 (name, age, city) VALUES ('Bob', 25, 'Los Angeles');
# Insert data in sql table in python
cursor.execute("INSERT INTO people2 (name, age, city) VALUES ('Alice', 30, 'New York')")
cursor.execute("INSERT INTO people2 (name, age, city) VALUES ('Bob', 25, 'Los Angeles')")
# Commit the changes
connection.commit()

In [24]:
#SQL Syntax for Querying Data
#To retrieve data from the table, you use the SELECT statement

# SELECT * FROM people;
# Query the data from sql table using python
cursor.execute("Select * from people2")
# Fetch all results
results = cursor.fetchall()
# Display the results
for row in results:
 print(row)

(1, 'Alice', 30, 'New York')
(2, 'Bob', 25, 'Los Angeles')

In [25]:
# create dataframe of your results

import pandas as pd
df = pd.DataFrame(results)
df

   0      1   2            3
0  1  Alice  30     New York
1  2    Bob  25  Los Angeles

In [26]:
df.columns = ["Id","Name","Age","City"]
df

   Id   Name  Age         City
0   1  Alice   30     New York
1   2    Bob   25  Los Angeles

In [27]:
#Closing the connection

connection.close()  #you cannot close connection until you are working with one database.

In [1]:
# Example 2

# import dependency
import sqlite3 as sql
# create a connection to the database and a cursor to execute queries
conn = sql.connect('demo.db')
cur = conn.cursor()
# create the table
cur.execute("CREATE TABLE movies1(title, year, score)")
cur.execute("""
  INSERT INTO movies1 VALUES
 ('Monty Python and the Holy Grail', 1975, 8.2),
 ('And Now for Something Completely Different', 1971, 7.5)
""")
conn.commit() # Remember to commit the transaction after executing INSERT
data = [
 ("Monty Python Live at the Hollywood Bowl", 1982, 7.9),
 ("Monty Python's The Meaning of Life", 1983, 7.5),
 ("Monty Python's Life of Brian", 1979, 8.0),
]
cur.executemany("INSERT INTO movies1 VALUES(?, ?, ?)", data)
conn.commit() # Remember to commit the transaction after executing INSERT.
# query data from database
query = "SELECT * FROM movies1"
results = cur.execute(query).fetchall()
results
for row in cur.execute("SELECT year, title FROM movies1 ORDER BY year"):
 print(row)
import pandas as pd
df = pd.DataFrame(results)
print(df)

(1971, 'And Now for Something Completely Different')
(1975, 'Monty Python and the Holy Grail')
(1979, "Monty Python's Life of Brian")
(1982, 'Monty Python Live at the Hollywood Bowl')
(1983, "Monty Python's The Meaning of Life")
                                            0     1    2
0             Monty Python and the Holy Grail  1975  8.2
1  And Now for Something Completely Different  1971  7.5
2     Monty Python Live at the Hollywood Bowl  1982  7.9
3          Monty Python's The Meaning of Life  1983  7.5
4                Monty Python's Life of Brian  1979  8.0